INSERT INTO "public"."configs" ("id", "event_year", "name", "is_active", "admin_password") VALUES
	(1, 2026, '外苑祭', true, 'admin123');

INSERT INTO "public"."teachers" ("id", "grade", "classId", "name") VALUES
	(1, 1, 1, '鈴木昭夫'),
	(2, 1, 2, '小林優子'),
	(3, 1, 3, '樋口雄一'),
	(4, 1, 4, '中井潤一郎'),
	(5, 1, 5, '中村勘太'),
	(6, 1, 6, '北條悠子'),
	(7, 1, 7, '滝石有紀'),
	(8, 2, 1, '真柴晶彦'),
	(9, 2, 2, '木村麻千子'),
	(10, 2, 3, '廣田大地'),
	(11, 2, 4, '後藤辰雄'),
	(12, 2, 5, '三浦伊都子'),
	(13, 2, 6, '早川洋志'),
	(14, 2, 7, '小川真一'),
	(15, 3, 1, '熊谷聡一郎'),
	(16, 3, 2, '橋口まりこ'),
	(17, 3, 3, '川﨑雅人'),
	(18, 3, 4, '神谷智恵美'),
	(19, 3, 5, '田代敦士'),
	(20, 3, 6, '本谷貴'),
	(21, 3, 7, '桑野愛');
